Pandas: Series Object

In [5]:
#creating a series using pandas
import pandas as pd
data = [1,2,3,4]
series1 = pd.Series(data)
series1

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
#changin an index in series
data = [1,2,3,4]
series2 = pd.Series(data,index = ["a","b","c","d"])
series2

a    1
b    2
c    3
d    4
dtype: int64

How to create a DataFrame in pandas

In [9]:
#creating a DataFrame using a List
data = [300,400,450,470,500]
series2 = pd.DataFrame(data,index=[1,2,3,4,5])
series2

     0
1  300
2  400
3  450
4  470
5  500

In [10]:
#creating a DataFrame using a Dictionary
Dictionary ={"Fruits":["Apple","Banana","Mango"],"Count":[12,12,13]}
df =pd.DataFrame(Dictionary)
df

   Fruits  Count
0   Apple     12
1  Banana     12
2   Mango     13

In [16]:
#Creating a DataFrame of students and their marks
dictionary = {"Name":["Basharat","Javid","Aabid","Babar"],"Marks":[450,400,350,320],"Max":[500,500,500,500]}
df2 = pd.DataFrame(dictionary)
df2

       Name  Marks  Max
0  Basharat    450  500
1     Javid    400  500
2     Aabid    350  500
3     Babar    320  500

In [17]:
#creating a DataFrame using Series
series = pd.Series([4,5],index = ["a","b"])
df3 = pd.DataFrame(series)
df3

   0
a  4
b  5

In [26]:
#creating a DataFrame using a numpy array
import numpy as np
numpyarr = np.array([[50000,60000],["Basharat","Mubashir"]])
df4= pd.DataFrame({"Name":numpyarr[1],"salary":numpyarr[0]})
df4

       Name salary
0  Basharat  50000
1  Mubashir  60000

In [32]:
marksarr = np.array([["Basharat","Javid"],[426,432]])
df5 = pd.DataFrame({"Name":marksarr[0],"Marks":marksarr[1]},index = ['a','b'])
df5

       Name Marks
a  Basharat   426
b     Javid   432